In [1]:
import pandas as pd

In [4]:
y=pd.read_csv('u.csv')

In [7]:
y

       196   242  3  881250949
0      186   302  3  891717742
1       22   377  1  878887116
2      244    51  2  880606923
3      166   346  1  886397596
4      298   474  4  884182806
...    ...   ... ..        ...
99994  880   476  3  880175444
99995  716   204  5  879795543
99996  276  1090  1  874795795
99997   13   225  2  882399156
99998   12   203  3  879959583

[99999 rows x 4 columns]

In [13]:
a=y.groupby('196')
a=a.get_group(1)

In [26]:
a['242'][a['196']==1]

201       61
304      189
332       33
333      160
477       20
        ...
92048     28
92486    172
94018    122
96698    152
99072     94
Name: 242, Length: 272, dtype: int64